Revit 2027 API
BuiltInFailures.SiteFailures.NoHostForSubregionWarn Property
 This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoHostForSubregionWarn { get; }
Public Shared ReadOnly Property NoHostForSubregionWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoHostForSubregionWarn {
	FailureDefinitionId^ get ();
}
static member NoHostForSubregionWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace